In [1]:
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
import pandas as pd
#import seaborn as sns

In [2]:
df= pd.DataFrame({
    'area': [2600, 3000, 3200, 3600, 4000,4100],
    'bedroom':[3, 4,np.nan, 3, 5, 6],
    'age':[20,15,18,30,8,8],
    'price': [550000, 565000, 610000, 595000, 760000, 810000]
})
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000
5  4100      6.0    8  810000

In [9]:
df.isnull().sum()

area       0
bedroom    0
age        0
price      0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   area     6 non-null      int64
 1   bedroom  6 non-null      float64
 2   age      6 non-null      int64
 3   price    6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

In [3]:
#df['bedroom'].median()
#df['bedroom'] = df['bedroom'].fillna(df['bedroom'].median()[0])
#df

#df['bedroom']=pd.to_numeric(df['bedroom'])
#df['bedroom'].median()
#df=df.mask(df==0).fillna(df.median())
#df


#df.bedroom.median()
#df.bedroom=df.bedroom.fillna(df.bedroom.median())
#df

mean_value=df['bedroom'].median()
df.fillna(mean_value, inplace=True)
df
#mean_value

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      4.0   18  610000
3  3600      3.0   30  595000
4  4000      5.0    8  760000
5  4100      6.0    8  810000

In [4]:
X=df.drop(['price'],axis=1)
X

   area  bedroom  age
0  2600      3.0   20
1  3000      4.0   15
2  3200      4.0   18
3  3600      3.0   30
4  4000      5.0    8
5  4100      6.0    8

In [8]:
y=df.price
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [6]:
from sklearn import linear_model
reg=linear_model.LinearRegression()

In [7]:
reg.fit(X,y)

LinearRegression()

# predict the price of a house that has the following features
area= 3000
bedroom=4
age=40